In [3]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df.drop(['PassengerId', 'Name',  'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], inplace = True, axis='columns')
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [7]:
target = df.Survived
inputs= df.drop(['Survived'], axis='columns')

In [8]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [9]:
inputs = pd.concat([inputs, dummies], axis = 'columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [13]:
inputs.drop(['Sex'], axis='columns', inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [14]:
# Check if NaN
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [15]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [18]:
# Fill in NaN values
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [17]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [68]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [69]:
len(x_test)

268

In [70]:
len(x_train)

623

In [71]:
len(inputs)

891

In [72]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model

GaussianNB()

In [73]:
model.fit(x_train, y_train)

GaussianNB()

In [74]:
model.score(x_test, y_test)

0.7947761194029851

In [30]:
x_test[:10]

     Pclass        Age      Fare  female  male
35        1  42.000000   52.0000       0     1
396       3  31.000000    7.8542       1     0
250       3  29.699118    7.2500       0     1
116       3  70.500000    7.7500       0     1
710       1  24.000000   49.5042       1     0
877       3  19.000000    7.8958       0     1
879       1  56.000000   83.1583       1     0
586       2  47.000000   15.0000       0     1
418       2  30.000000   13.0000       0     1
325       1  36.000000  135.6333       1     0

In [31]:
y_test[:10]

35     0
396    0
250    0
116    0
710    1
877    0
879    1
586    0
418    0
325    1
Name: Survived, dtype: int64

In [32]:
model.predict(x_test[:10])

array([0, 1, 0, 0, 1, 0, 1, 0, 0, 1], dtype=int64)

In [ ]:
submission = pd.DataFrame({
    "PassengerId" : test_passenger_ids,
    "Survived" : y_pred
})
submission.head(10)